# -*- coding: utf-8 -*-
"""Домашнее задание 2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1G_p2GGlWeBgigWt1kXl9qMDV_cd4pKA1

Домашнее задание 1. 
*Напишите на Python реализацию как минимум одного алгоритма на выбор: любая на выбор цветовая обработка, перевод в другое цветовое пространство или фильтрация. Изображение выберите самостоятельно.*
"""

# Commented out IPython magic to ensure Python compatibility.
#Загружаю библиотеки
# %matplotlib inline
import matplotlib.pyplot as plt
import numpy as np

import imageio.v2 as imageio #Использую локальные ресурсы. Автор библиотеки рекомендует эту библиотеку для пропуска предупреждений

img = imageio.imread('raw.jpg')
img = img.astype(np.float32) / 255.

print("Ok") if img.shape==(1280, 960, 3) else print('not Ok') #Ну а вдруг опять

edge = 0.593 # оптимальный подобранный мной порог
img_bw = np.mean(img, axis=2)
img_bin = (img_bw > edge).astype(np.uint8)

comprehansion=plt.figure(figsize=(15, 10))
comprehansion.add_subplot(1,2,1)
plt.imshow(img)
comprehansion.add_subplot(1, 2, 2)
plt.imshow(img_bin)
axes="off"
plt.show()
